thingOnStick/constant/region2/thermalProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          thermalProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

C               C [0 2 -2 -1 0 0 0] 434;

k               k [1 1 -3 -1 0 0 0] 60.5;

alpha           alpha [0 0 0 -1 0 0 0] 1.1e-05;

thermalStress   no;


// ************************************************************************* //
