thingOnStick/0/region1/cellMotionU
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          motionU;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    inlet      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }    
    obstacle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    mitte
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
